IDS_DGN_MEMB_USE_TYPE_DWGREP                  = "Dwg & Report"
IDS_DGN_MEMB_USE_TYPE_DRAWING                 = "Dwg Only"
IDS_DGN_MEMB_USE_TYPE_REPORT                  = "Report Only"
IDS_DGN_MEMB_USE_TYPE_NONE                    = "None"
IDS_DGN_MEMB_USE_TYPE_MEMBER                  = "By Member"

IDS_DGN_MEMB_GIRDER                           = "Girder"
IDS_DGN_MEMB_GIRDER_MAIN                      = "Main Girder"
IDS_DGN_MEMB_GIRDER_SUB                       = "Sub Girder"
IDS_DGN_MEMB_BEAM                             = "Beam"
IDS_DGN_MEMB_COLUMN                           = "Column"
IDS_DGN_MEMB_COLUMN_LOWER                     = "Lower Column"
IDS_DGN_MEMB_COLUMN_UPPER                     = "Upper Column"
IDS_DGN_MEMB_BRACKET                          = "Bracket"
IDS_DGN_MEMB_BRACKET_LOWER                    = "Lower Bracket"
IDS_DGN_MEMB_BRACKET_UPPER                    = "Upper Bracket"
IDS_DGN_MEMB_STIFFENER                        = "Stiffener"
IDS_DGN_MEMB_STIFFENER_TOP                    = "Top Stiffener"
IDS_DGN_MEMB_STIFFENER_BOT                    = "Bottom Stiffener"
IDS_DGN_MEMB_STIFFENER_WEB                    = "Column Web Stiffener"
IDS_DGN_MEMB_BOLT                             = "Bolt"
IDS_DGN_MEMB_PLATE                            = "Plate"
IDS_DGN_LAYOUT                                = "Layout"
IDS_DGN_FORCE                                 = "Force"
IDC_DGN_CHK_DRAW_DIMS                      	  = "Draw Dimension"

IDS_DGN_CHK                                   = "CHK"
IDS_DGN_CHECK                                 = "Check"
IDS_DGN_MEMBER_TYPE                           = "Member Type"
IDS_DGN_MEMBER_NAME                           = "Member Name"

IDS_DGN_FAIL_CREATE_EXCEL                     = "Microsoft Excel is not Created."
IDS_DGN_FAIL_WRITE_TO_EXCEL                   = "Failed at Converting Grid to Microsoft Excel."
IDS_DGN_FAIL_SAVE_AND_OPEN_EXCEL              = "Failed at Save Excel File. Can't open Excel File."
IDS_DGN_EXPORT_GRID_TO_EXCEL                  = "Convert Table to Excel File"
IDS_DGN_NOT_EXIST_DATA_TO_EXPORT_TO_EXCEL     = "There is no Data to Export to Excel File."

IDS_DGN_EXCEL_EXPORT_LOAD_INFO                = "Load Description"
IDS_DGN_EXCEL_EXPORT_LOAD_DEAD                = "Dead Load"
IDS_DGN_EXCEL_EXPORT_LOAD_LIVE                = "Live Load"
IDS_DGN_EXCEL_EXPORT_LOAD_SERV                = "Service Load"
IDS_DGN_EXCEL_EXPORT_LOAD_FACT                = "Factored Load"
IDS_DGN_EXCEL_EXPORT_LOAD_SUM                 = "SUM."

IDS_DGN_EXCEL_BATCHWALL_STORY                 = "Story"
IDS_DGN_EXCEL_BATCHWALL_SECTION               = "Section"
IDS_DGN_EXCEL_BATCHWALL_MATERIAL              = "Material"
IDS_DGN_EXCEL_BATCHWALL_LW_CONC               = "LW. Conc."
IDS_DGN_EXCEL_BATCHWALL_FACTOR                = "Factor"
IDS_DGN_EXCEL_BATCHWALL_MOMENT                = "Moment"
IDS_DGN_EXCEL_BATCHWALL_SHEAR                 = "Shear"
IDS_DGN_EXCEL_BATCHWALL_RATIO                 = "Ratio"
IDS_DGN_EXCEL_BATCHWALL_LENGTH                = "Length"
IDS_DGN_EXCEL_BATCHWALL_VER_BAR               = "Vertical Bar"
IDS_DGN_EXCEL_BATCHWALL_HOR_BAR               = "Horizontal Bar"
IDS_DGN_EXCEL_BATCHWALL_END_BAR               = "End Bar"
IDS_DGN_EXCEL_BATCHWALL_BE_BAR                = "Boundary Element Bar"
IDS_DGN_EXCEL_BATCHWALL_BAR_NAME              = "Name"
IDS_DGN_EXCEL_BATCHWALL_BAR_AREA              = "Area"
IDS_DGN_EXCEL_BATCHWALL_BAR_SPACE             = "Space"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO                = "No"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO1               = "No1"
IDS_DGN_EXCEL_BATCHWALL_BAR_NO2               = "No2"
IDS_DGN_EXCEL_BATCHWALL_BAR_SMAX              = "Smax"

IDS_DGN_QUANTITY_BATCHWALL_GENERAL            = "General"
IDS_DGN_QUANTITY_BATCHWALL_NAME               = "Name"
IDS_DGN_QUANTITY_BATCHWALL_STORY              = "Story"
IDS_DGN_QUANTITY_BATCHWALL_SECTION            = "Section"
IDS_DGN_QUANTITY_BATCHWALL_REBAR              = "Rebar"
IDS_DGN_QUANTITY_BATCHWALL_VER_BAR            = "VBar"
IDS_DGN_QUANTITY_BATCHWALL_HOR_BAR            = "HBar"
IDS_DGN_QUANTITY_BATCHWALL_END_BAR            = "EBar"
IDS_DGN_QUANTITY_BATCHWALL_QUANTITY           = "Quantity"
IDS_DGN_QUANTITY_BATCHWALL_CONCRETE           = "Concrete"
IDS_DGN_QUANTITY_BATCHWALL_SUM                = "Sum."
IDS_DGN_QUANTITY_BATCHWALL_TOTAL              = "Total"

IDS_DGN_QUANTITY_NOT_EXIST_DATA               = "There is no data to calculate Quantity."

IDS_DGN_CALC_FAIL                             = "Member design has failed."
IDS_DGN_OPT_CHANGE_STEEL_SECTION_LIST         = "Steel section DB is changed.\nDo you want to reset steel section list of Steel Option?"
IDS_DGN_OPT_CHANGE_ALUMINUM_SECTION_LIST      = "Aluminum section DB is changed.\nDo you want to reset aluminum section list of Aluminum Option?"

IDS_DGN_NOT_SELECT_DATA                       = "There is no element or position selected to design."
IDS_DGN_NOT_SELECT_NODE                       = "There is no node selected."
IDS_DGN_NOT_INPUT_SECTNAME                    = "Name of member to be checked does not exist."
IDS_DGN_NOT_SELECT_UMD                        = "There is no selected item."
IDS_DGN_NO_SELECTED_SECTION                   = "[Error] No section has been selected."
IDS_DB_UPLINK_PROGRAM_GUID_NOT_MATCH          = "Batch Wall may have been created in other file.\n\nDo you want to update wall data?"
IDS_DGN_NOT_VALID_PROGRAM_RGW                 = "Batch Wall is created by Gen NOT supporting Export.\nGen V940 / Design+ V490 or Above support Export."
IDS_DGN_NOT_EXIST_RBB                         = "Batch Beam Data is NOT Exist."
IDS_DGN_NOT_EXIST_RBC                         = "Batch Column Data is NOT Exist."
IDS_DGN_NOT_EXIST_RGW                         = "Batch Wall Data is NOT Exist."

IDS_DGN_NOT_EXIST_RC_COLUMN                   = "There is no RC Column Data."
IDS_DGN_CONVERT_COLUMN_RCSRC                  = "RC Column->SRC Column"
IDS_DGN_CONVERT_COLUMN_RCGSC                  = "RC Column->General Section Column"
IDS_DGN_CONVERT_TO_GUSCO                      = "Convert to SRC Column"
IDS_DGN_CONVERT_TO_GUCCO                      = "Convert to General Column"

IDS_DGN_NOT_DRAW_DATA_ERROR                   = "Cannot generate the section drawing."
IDS_DGN_INVALID_FORMULA                       = "Invalid formula"
IDS_DGN_CHARACTER_EXIST                       = "Character exists."
IDS_DGN_BIG_VALUE                             = "Value is too large."
IDS_DGN__ADDD__Integer_Is_Required            = "Integer number is required."
IDS_DGN__ADDD___CCMLoadCaseGrid__ValidateField__  = "<CCMLoadCaseGrid::ValidateField> Error: Out of range column id!"
IDS_DGN__ADDD___has_not_been_entered_         = " Not entered."

IDS_DGN_CELL_DELETED_DATA_IS_INCORRECT_SPECIFY_CELL_AGAIN  = "Selected cells to be deleted are not correct. Select the cells again."
IDS_DGN_CELL_INSERTED_IS_INCORRECT_SPECIFY_CELL_AGAIN  = "Selected cells to be interted are not correct. Select the cells again."

IDS_DGN_OPTION_INVALID_MESSAGE                = "There is error in option data. Check the message window."
IDS_DGN_DATABASE_INVALID_MESSAGE              = "There is error in Data Base data. Check the message window."
IDS_DGN_REBAR_INVALID_MESSAGE                 = "There is error in Rebar data. Check the message window."
IDS_DGN_STL_OPTION_INVALID_MESSAGE            = "There is error in Steel Option Data. Check the message window."
IDS_DGN_ALU_OPTION_INVALID_MESSAGE            = "There is error in Aluminum Option Data. Check the message window."

IDS_DGN_COVER_OPT_DLG_CAPTION                 = "Modify DB Data"
IDS_DGN_COVER_OPT_CHANGED                     = "Option for cover is changed."
IDS_DGN_COVER_OPT_CHANGE_DB_DATA              = "Do you want to change current DB Data?"
IDS_DGN_COVER_DATA_CHANGE_GSLAB               = "Change RC Slab Data"
IDS_DGN_COVER_DATA_CHANGE_GURBE               = "Change RC Beam Data"
IDS_DGN_COVER_DATA_CHANGE_GURCO               = "Change RC Column Data"
IDS_DGN_COVER_DATA_CHANGE_GURGC               = "Change RC General Column Data"
IDS_DGN_COVER_DATA_CHANGE_GURSW               = "Change RC Shear Wall Data"
IDS_DGN_COVER_DATA_CHANGE_GURSF               = "Change RC Strip Footing Data"
IDS_DGN_COVER_DATA_CHANGE_GURDW               = "Change RC Combined Wall Data"
IDS_DGN_COVER_DATA_CHANGE_GUFDN               = "Change RC Footing Data"
IDS_DGN_COVER_DATA_CHANGE_GUCBF               = "Change RC Combined Footing Data"
IDS_DGN_COVER_DATA_CHANGE_GURCF               = "Change RC Combined Footing Data"
IDS_DGN_COVER_DATA_CHANGE_GURBW               = "Change RC Basement Wall Data"
IDS_DGN_COVER_DATA_CHANGE_GURBU               = "Change RC Buttress Data"
IDS_DGN_COVER_DATA_CHANGE_GURST               = "Change RC Stair Data"
IDS_DGN_COVER_DATA_CHANGE_GURCB               = "Change RC Corbel / Bracket Data"
IDS_DGN_COVER_DATA_CHANGE_GURBL               = "Change RC Beam Table Data"
IDS_DGN_COVER_DATA_CHANGE_GURSL               = "Change RC Slab Table Data"
IDS_DGN_COVER_DATA_CHANGE_GURRW               = "Change RC Retaining Wall Data"
IDS_DGN_COVER_DATA_CHANGE_GBWUW               = "Change RC Batch Wall Data"
IDS_DGN_COVER_DATA_CHANGE_GUCCO               = "Change SRC Column Data"
IDS_DGN_COVER_DATA_CHANGE_GUFSL               = "Change RC Slab Reinforce Data"
IDS_DGN_COVER_DATA_CHANGE_GUFBE               = "Change RC Beam Reinforce Data"
IDS_DGN_COVER_DATA_CHANGE_GURAB               = "Change RC Anchor Bolt Data"

IDS_DGN_OPTION_RC_MESSAGE_HEADER              = "[ CHECK RESULT OF RC OPTION ]"
IDS_DGN_OPTION_STEEL_MESSAGE_HEADER           = "[ CHECK RESULT OF STEEL OPTION ]"
IDS_DGN_OPTION_SRC_MESSAGE_HEADER             = "[ CHECK RESULT OF SRC OPTION ]"
IDS_DGN_OPTION_CFS_MESSAGE_HEADER             = "[ CHECK RESULT OF COLD-FORM DESIGN OPTION ]"
IDS_DGN_OPTION_ALU_MESSAGE_HEADER             = "[ CHECK RESULT OF ALUMINUM DESIGN OPTION ]"
IDS_DGN_OPTION_RFM_MESSAGE_HEADER             = "[ CHECK RESULT OF REINFORCEMENT DESIGN OPTION ]"

IDS_DGN_OPTION_INVALID_CODE_NAME              = "Design+ does not support %s code."
IDS_DGN_OPTION_INVALID_RATIO_BENDING          = "Invalid Target Ratio : Bending < 0"
IDS_DGN_OPTION_INVALID_RATIO_COMPRESSION      = "Invalid Target Ratio : Compression < 0"
IDS_DGN_OPTION_INVALID_RATIO_TENSION          = "Invalid Target Ratio : Tension < 0"
IDS_DGN_OPTION_INVALID_RATIO_SHEAR            = "Invalid Target Ratio : Shear & Torsion < 0"
IDS_DGN_OPTION_INVALID_RATIO_OTHERS           = "Invalid Target Ratio : Others < 0"

IDS_DGN_KFACTOR_TYPE_PINPIN                   = "Pin-Pin"
IDS_DGN_KFACTOR_TYPE_FIXFIX                   = "Fix-Fix"
IDS_DGN_KFACTOR_TYPE_PINFIX                   = "Pin-Fix"
IDS_DGN_KFACTOR_TYPE_CANTILEVER               = "Cantilever"
IDS_DGN_KFACTOR_TYPE_USER                     = "User"

IDS_DGN_PREF_DRAW_LIST_NAME                   = "Name"
IDS_DGN_PREF_DRAW_LIST_COLOR                  = "Color"
IDS_DGN_PREF_DRAW_LIST_LINETYPE               = "Line Type"
IDS_DGN_PREF_DRAW_LIST_NOTE                   = "Note"

IDS_DGN_EXPORT_REPORT_DET                     = "Create Report [ Detail, %s ]"
IDS_DGN_EXPORT_REPORT_SUM                     = "Create Report [ Summary, %s ]"
IDS_DGN_EXPORT_REPORT_INP                     = "Create Report [ Input Data, %s ]"
IDS_DGN_EXPORT_QUICK_DET                      = "Create Report [ Detail, %s ]"
IDS_DGN_EXPORT_QUICK_SUM                      = "Create Report [ Summary, %s ]"
IDS_DGN_EXPORT_QUICK_INP                      = "Create Report [ Input Data, %s ]"
IDS_DGN_QUICK_REPORT_CREATEION_ERROR          = "There is no data(s) to create report.\n Generation of report is aborted."
IDS_DGN_EXPORT_FAIL_CREATE_FOLDER             = "Can't create specified folder. Check your folder name."

IDS_DGN_TABLE_HEAD_SERIAL_NO                  = "SN"
IDS_DGN_TABLE_HEAD_SIZE                       = "Size"
IDS_DGN_TABLE_HEAD_LEGNO                      = "Leg No."
IDS_DGN_TABLE_HEAD_RATIO                      = "Ratio"
IDS_DGN_TABLE_HEAD_SPAN                       = "Span"
IDS_DGN_TABLE_HEAD_DISTANCE                   = "Dist."

DGN_FORCE_DLG_NOTICE_ALU_MTCHK                = "LCB1 will be replaced by governing Load Combination after Check/Design."
DGN_FORCE_DLG_NOTICE_STL_SGCHK                = "LCB1 will be replaced by governing Load Combination after Check/Design."
DGN_FORCE_DLG_NOTICE_STL_BPCHK                = "LCB1 will be replaced by governing Load Combination after Check/Design."
DGN_FORCE_DLG_NOTICE_RCS_FNCHK                = "LCB1 will be replaced by governing Load Combination after Check/Design."
DGN_FORCE_DLG_NOTICE_RCS_GCCHK                = "LCB0 is combined by forces governing P-M strength and shear strength respectively."
IDS_DGN_PREF_GENERAL_NOTICE                   = "Columns (RC, SRC) Use Distance from Face to Center Regardless of Option."
DGN_FORCE_DLG_LCOM_DESCRIPTION                = "Description"
DGN_FORCE_DLG_LCOM_NO2                        = "Invalid Load Combinations : No of Combination < 2"
DGN_FORCE_DLG_LCOM_ACTIVE                     = "At lease 1 Active Load Combination is Required.\n\nUse Check Button to Activate Load Combination."

IDS_DGN_EXPORT_SELECT_FOLDER                  = "Select the target folder to save an output.\n\n(The file can be saved in DWG, EMF, BMP and JPG format.)"
IDS_DGN_SEC_FILE_FOLDER                       = "Select the folder which *.sec file exist. \n\n(You can make *.sec file with GSD.)"

IDS_DGN_BASIC_SNOW_LOAD                       = "Basic Snow Load"
IDS_DGN_BASIC_DESIGN_WIND_VELOCITY            = "Basic Wind Velocity"
IDS_DGN_ROOF_AVER_HEIGHT                      = "Average Height of Roof"
IDS_DGN_DESIGN_ELEM_LOCA_HEIGHT               = "Installation Height of Target Member"
IDS_DGN_WIND_LOAD_MSG_BUILD_TYPE              = "Building Type is Empty."
IDS_DGN_WIND_LOAD_MSG_ROOF_TYPE               = "Roof Type is Empty."
IDS_DGN_WIND_LOAD_MSG_CHECK_POINT             = "Check Point is Empty."

IDS_DGN_STIFFENER_SECT_B                      = "Width of Stiffener"
IDS_DGN_STIFFENER_SECT_S                      = "Spacing of Stiffener"
IDS_DGN_STIFFENER_FORCE_V                     = "Concentrated Force"
IDS_DGN_STIFFENER_FORCE_M                     = "Moment at Position of Concentrated Force"
IDS_DGN_STIFFENER_FORCE_B                     = "Bearing Length of Concentrated Force"
IDS_DGN_STIFFENER_FORCE_D                     = "Distance of Concentrated Force from End of Member"

IDS_DGN_TORSION_FORCE_POSITION                = "Distance of Concentrated Force from End of Member"

IDS_DGN_QUANTITY_SIZE_N                       = "Size\n"
IDS_DGN_QUANTITY_STIRRUP_N                    = "Stirrup\n"
IDS_DGN_QUANTITY_TRANSVERSE_N                 = "Transverse\n"
IDS_DGN_QUANTITY_CONCRETE_N                   = "Concrete\n"
IDS_DGN_QUANTITY_FORM_N                       = "Form\n"
IDS_DGN_QUANTITY_TOP_N                        = "Top\n"
IDS_DGN_QUANTITY_BOTTOM_N                     = "Bottom\n"
IDS_DGN_QUANTITY_SUM_N                        = "Sum\n"
IDS_DGN_QUANTITY_GENERATE_STRIP_FOOTING_EXCEL_FILE  = "Generating strip footing quantity excel file."
IDS_DGN_QUANTITY_TOTAL_N                      = "Total\n"
IDS_DGN_NOT_EXIST_RC_COMBINED_WALL            = "There is no RC Combined Wall Data."

// UNIT CONVERTER (Tab)
IDS_DGN_UNIT_TAB_NAME_COM1                    = "Common-1"
IDS_DGN_UNIT_TAB_NAME_COM2                    = "Common-2"
IDS_DGN_UNIT_TAB_NAME_THER                    = "Thermal"
IDS_DGN_UNIT_TAB_NAME_ELEC                    = "Electric"
IDS_DGN_UNIT_TAB_NAME_MISC                    = "Miscellaneous"

// UNIT CONVERTER (Common-1)
IDS_DGN_UNIT_TYPE_STR_ENERG                   = "Energy / Work"
IDS_DGN_UNIT_TYPE_STR_ENTHA                   = "Enthalpy"
IDS_DGN_UNIT_TYPE_STR_ENTRO                   = "Entropy"
IDS_DGN_UNIT_TYPE_STR_FORCE                   = "Force / Weight"
IDS_DGN_UNIT_TYPE_STR_POWER                   = "Power"
IDS_DGN_UNIT_TYPE_STR_PRESS                   = "Pressure / Stress"
IDS_DGN_UNIT_TYPE_STR_WDENS                   = "Weight Density"
IDS_DGN_UNIT_TYPE_STR_TENSN                   = "Weight per Length"
IDS_DGN_UNIT_TYPE_STR_TORQU                   = "Moment / Torque"

IDS_DGN_UNIT_STRING_ENERG01                   = "J"
IDS_DGN_UNIT_STRING_ENERG02                   = "kJ"
IDS_DGN_UNIT_STRING_ENERG03                   = "erg"
IDS_DGN_UNIT_STRING_ENERG04                   = "W-h"
IDS_DGN_UNIT_STRING_ENERG05                   = "kW-h"
IDS_DGN_UNIT_STRING_ENERG06                   = "MW-h"
IDS_DGN_UNIT_STRING_ENERG07                   = "kgf-m (kp-m)"
IDS_DGN_UNIT_STRING_ENERG08                   = "gf-cm (p-cm)"
IDS_DGN_UNIT_STRING_ENERG09                   = "cal"
IDS_DGN_UNIT_STRING_ENERG10                   = "kcal"
IDS_DGN_UNIT_STRING_ENERG11                   = "ks-s (ps-s)"
IDS_DGN_UNIT_STRING_ENERG12                   = "ks-h (ps-h)"
IDS_DGN_UNIT_STRING_ENERG13                   = "eV"
IDS_DGN_UNIT_STRING_ENERG14                   = "Mev"
IDS_DGN_UNIT_STRING_ENERG15                   = "ft-pdl"
IDS_DGN_UNIT_STRING_ENERG16                   = "lbf-ft"
IDS_DGN_UNIT_STRING_ENERG17                   = "hp.h"
IDS_DGN_UNIT_STRING_ENERG18                   = "Btu"
IDS_DGN_UNIT_STRING_ENERG19                   = "amu"
IDS_DGN_UNIT_STRING_ENERG20                   = "wavenumber"

IDS_DGN_UNIT_STRING_ENTHA01                   = "J/kg"
IDS_DGN_UNIT_STRING_ENTHA02                   = "kJ/kg"
IDS_DGN_UNIT_STRING_ENTHA03                   = "cal/g"
IDS_DGN_UNIT_STRING_ENTHA04                   = "cal/kg"
IDS_DGN_UNIT_STRING_ENTHA05                   = "kcal/kg"
IDS_DGN_UNIT_STRING_ENTHA06                   = "Btu/lb"

IDS_DGN_UNIT_STRING_ENTRO01                   = "J/kg'C"
IDS_DGN_UNIT_STRING_ENTRO02                   = "kJ/kg'C"
IDS_DGN_UNIT_STRING_ENTRO03                   = "cal/g'C"
IDS_DGN_UNIT_STRING_ENTRO04                   = "cal/kg'C"
IDS_DGN_UNIT_STRING_ENTRO05                   = "kcal/kg'C"
IDS_DGN_UNIT_STRING_ENTRO06                   = "Btu/lb'F"

IDS_DGN_UNIT_STRING_POWER01                   = "W (J/s, Nm/s)"
IDS_DGN_UNIT_STRING_POWER02                   = "kW (kJ/s)"
IDS_DGN_UNIT_STRING_POWER03                   = "erg/s"
IDS_DGN_UNIT_STRING_POWER04                   = "kgf-m/s"
IDS_DGN_UNIT_STRING_POWER05                   = "PS (KS)"
IDS_DGN_UNIT_STRING_POWER06                   = "cal/s"
IDS_DGN_UNIT_STRING_POWER07                   = "kcal/h"
IDS_DGN_UNIT_STRING_POWER08                   = "kcal/min"
IDS_DGN_UNIT_STRING_POWER09                   = "pdl-ft/s"
IDS_DGN_UNIT_STRING_POWER10                   = "lbf-ft/min"
IDS_DGN_UNIT_STRING_POWER11                   = "lbf-ft/s"
IDS_DGN_UNIT_STRING_POWER12                   = "hp"
IDS_DGN_UNIT_STRING_POWER13                   = "Btu/h"
IDS_DGN_UNIT_STRING_POWER14                   = "Btu/min"
IDS_DGN_UNIT_STRING_POWER15                   = "prony"
IDS_DGN_UNIT_STRING_POWER16                   = "rt (ref. ton)"
IDS_DGN_UNIT_STRING_POWER17                   = "US rt (CTR)"

IDS_DGN_UNIT_STRING_FORCE01                   = "N"
IDS_DGN_UNIT_STRING_FORCE02                   = "kN"
IDS_DGN_UNIT_STRING_FORCE03                   = "dyne"
IDS_DGN_UNIT_STRING_FORCE04                   = "pdl (poundal)"
IDS_DGN_UNIT_STRING_FORCE05                   = "lbf"
IDS_DGN_UNIT_STRING_FORCE06                   = "kips"
IDS_DGN_UNIT_STRING_FORCE07                   = "tf"
IDS_DGN_UNIT_STRING_FORCE08                   = "kgf (kp)"
IDS_DGN_UNIT_STRING_FORCE09                   = "p (pond, gf)"
IDS_DGN_UNIT_STRING_FORCE10                   = "ozf"
IDS_DGN_UNIT_STRING_FORCE11                   = "UK tf"

IDS_DGN_UNIT_STRING_PRESS01                   = "Pa (N/m²)"
IDS_DGN_UNIT_STRING_PRESS02                   = "kPa"
IDS_DGN_UNIT_STRING_PRESS03                   = "MPa (N/mm²)"
IDS_DGN_UNIT_STRING_PRESS04                   = "dyne/cm²"
IDS_DGN_UNIT_STRING_PRESS05                   = "bar"
IDS_DGN_UNIT_STRING_PRESS06                   = "tf/cm²"
IDS_DGN_UNIT_STRING_PRESS07                   = "kgf/m² (kp/m²)"
IDS_DGN_UNIT_STRING_PRESS08                   = "kgf/cm² (kp/cm²)"
IDS_DGN_UNIT_STRING_PRESS09                   = "mmAq (mmH20)"
IDS_DGN_UNIT_STRING_PRESS10                   = "inAq (inH20)"
IDS_DGN_UNIT_STRING_PRESS11                   = "ftAq (ftH20)"
IDS_DGN_UNIT_STRING_PRESS12                   = "mmHq (ftH20)"
IDS_DGN_UNIT_STRING_PRESS13                   = "inHg"
IDS_DGN_UNIT_STRING_PRESS14                   = "atm"
IDS_DGN_UNIT_STRING_PRESS15                   = "pdl/ft²"
IDS_DGN_UNIT_STRING_PRESS16                   = "lbf/in² (psi)"
IDS_DGN_UNIT_STRING_PRESS17                   = "lbf/ft² (psf)"
IDS_DGN_UNIT_STRING_PRESS18                   = "kips/in² (ksi)"
IDS_DGN_UNIT_STRING_PRESS19                   = "UK tf/in²"
IDS_DGN_UNIT_STRING_PRESS20                   = "UK tf/ft²"

IDS_DGN_UNIT_STRING_WDENS01                   = "N/m³"
IDS_DGN_UNIT_STRING_WDENS02                   = "kN/m³"
IDS_DGN_UNIT_STRING_WDENS03                   = "N/mm³"
IDS_DGN_UNIT_STRING_WDENS04                   = "kgf/m³"
IDS_DGN_UNIT_STRING_WDENS05                   = "kgf/cm³"
IDS_DGN_UNIT_STRING_WDENS06                   = "tf/cm³"
IDS_DGN_UNIT_STRING_WDENS07                   = "gf/cm³"
IDS_DGN_UNIT_STRING_WDENS08                   = "gf/mm³"
IDS_DGN_UNIT_STRING_WDENS09                   = "tf/m³"
IDS_DGN_UNIT_STRING_WDENS10                   = "tf/yd³"
IDS_DGN_UNIT_STRING_WDENS11                   = "lbf/in³"
IDS_DGN_UNIT_STRING_WDENS12                   = "lbf/ft³"
IDS_DGN_UNIT_STRING_WDENS13                   = "kips/in³"
IDS_DGN_UNIT_STRING_WDENS14                   = "kips/ft³"

IDS_DGN_UNIT_STRING_TENSN01                   = "N/m"
IDS_DGN_UNIT_STRING_TENSN02                   = "kN/m"
IDS_DGN_UNIT_STRING_TENSN03                   = "N/cm"
IDS_DGN_UNIT_STRING_TENSN04                   = "N/mm"
IDS_DGN_UNIT_STRING_TENSN05                   = "tf/m"
IDS_DGN_UNIT_STRING_TENSN06                   = "kgf/cm"
IDS_DGN_UNIT_STRING_TENSN07                   = "lbf/in"
IDS_DGN_UNIT_STRING_TENSN08                   = "kips/ft"
IDS_DGN_UNIT_STRING_TENSN09                   = "lbf/ft (plf)"
IDS_DGN_UNIT_STRING_TENSN10                   = "lbf/yd"
IDS_DGN_UNIT_STRING_TENSN11                   = "dyne/cm"

IDS_DGN_UNIT_STRING_TORQU01                   = "N-m"
IDS_DGN_UNIT_STRING_TORQU02                   = "kN-m"
IDS_DGN_UNIT_STRING_TORQU03                   = "dyne-cm"
IDS_DGN_UNIT_STRING_TORQU04                   = "tf-m"
IDS_DGN_UNIT_STRING_TORQU05                   = "tf-cm"
IDS_DGN_UNIT_STRING_TORQU06                   = "kgf-m (kg-m)"
IDS_DGN_UNIT_STRING_TORQU07                   = "kgf-cm (kp-cm)"
IDS_DGN_UNIT_STRING_TORQU08                   = "pdl-ft"
IDS_DGN_UNIT_STRING_TORQU09                   = "lbf-ft"
IDS_DGN_UNIT_STRING_TORQU10                   = "lbf-in"
IDS_DGN_UNIT_STRING_TORQU11                   = "kips-ft"
IDS_DGN_UNIT_STRING_TORQU12                   = "kips-in"
IDS_DGN_UNIT_STRING_TORQU13                   = "ozf-in"
IDS_DGN_UNIT_STRING_TORQU14                   = "UK tf-ft"

// UNIT CONVERTER (Common-2)
IDS_DGN_UNIT_TYPE_STR_ANGL                    = "Angle"
IDS_DGN_UNIT_TYPE_STR_AREA                    = "Area"
IDS_DGN_UNIT_TYPE_STR_DENS                    = "Density"
IDS_DGN_UNIT_TYPE_STR_LENG                    = "Length"
IDS_DGN_UNIT_TYPE_STR_MASS                    = "Mass"
IDS_DGN_UNIT_TYPE_STR_TIME                    = "Time"
IDS_DGN_UNIT_TYPE_STR_VELO                    = "Velocity"
IDS_DGN_UNIT_TYPE_STR_VOLM                    = "Volume"

IDS_DGN_UNIT_STRING_ANGL01                    = "Deg"
IDS_DGN_UNIT_STRING_ANGL02                    = "Min"
IDS_DGN_UNIT_STRING_ANGL03                    = "Sec"
IDS_DGN_UNIT_STRING_ANGL04                    = "Rad"
IDS_DGN_UNIT_STRING_ANGL05                    = "Rev"

IDS_DGN_UNIT_STRING_AREA01                    = "m²"
IDS_DGN_UNIT_STRING_AREA02                    = "cm²"
IDS_DGN_UNIT_STRING_AREA03                    = "mm²"
IDS_DGN_UNIT_STRING_AREA04                    = "km²"
IDS_DGN_UNIT_STRING_AREA05                    = "in²"
IDS_DGN_UNIT_STRING_AREA06                    = "ft²"
IDS_DGN_UNIT_STRING_AREA07                    = "yd²"
IDS_DGN_UNIT_STRING_AREA08                    = "rod²"
IDS_DGN_UNIT_STRING_AREA09                    = "mile²"
IDS_DGN_UNIT_STRING_AREA10                    = "a (are)"
IDS_DGN_UNIT_STRING_AREA11                    = "ha (hectare)"
IDS_DGN_UNIT_STRING_AREA12                    = "rood"
IDS_DGN_UNIT_STRING_AREA13                    = "acre"

IDS_DGN_UNIT_STRING_DENS01                    = "kg/m³"
IDS_DGN_UNIT_STRING_DENS02                    = "kg/l"
IDS_DGN_UNIT_STRING_DENS03                    = "kg/cm³"
IDS_DGN_UNIT_STRING_DENS04                    = "g/m³"
IDS_DGN_UNIT_STRING_DENS05                    = "g/l"
IDS_DGN_UNIT_STRING_DENS06                    = "g/cm³"
IDS_DGN_UNIT_STRING_DENS07                    = "g/mm³"
IDS_DGN_UNIT_STRING_DENS08                    = "t/m³"
IDS_DGN_UNIT_STRING_DENS09                    = "t/yd³"
IDS_DGN_UNIT_STRING_DENS10                    = "lb/in³"
IDS_DGN_UNIT_STRING_DENS11                    = "lb/ft³"
IDS_DGN_UNIT_STRING_DENS12                    = "slug/in³"
IDS_DGN_UNIT_STRING_DENS13                    = "Slug/ft³"
IDS_DGN_UNIT_STRING_DENS14                    = "lb/US gal"
IDS_DGN_UNIT_STRING_DENS15                    = "oz/US gal"
IDS_DGN_UNIT_STRING_DENS16                    = "lb/UK gal"
IDS_DGN_UNIT_STRING_DENS17                    = "oz/UK gal"

IDS_DGN_UNIT_STRING_LENG01                    = "m"
IDS_DGN_UNIT_STRING_LENG02                    = "cm"
IDS_DGN_UNIT_STRING_LENG03                    = "mm"
IDS_DGN_UNIT_STRING_LENG04                    = "km"
IDS_DGN_UNIT_STRING_LENG05                    = "in"
IDS_DGN_UNIT_STRING_LENG06                    = "ft"
IDS_DGN_UNIT_STRING_LENG07                    = "mile"
IDS_DGN_UNIT_STRING_LENG08                    = "US mile"
IDS_DGN_UNIT_STRING_LENG09                    = "UK mile"
IDS_DGN_UNIT_STRING_LENG10                    = "Light Year"
IDS_DGN_UNIT_STRING_LENG11                    = "Furlong"
IDS_DGN_UNIT_STRING_LENG12                    = "Fathom"
IDS_DGN_UNIT_STRING_LENG13                    = "rod"
IDS_DGN_UNIT_STRING_LENG14                    = "Parsec"
IDS_DGN_UNIT_STRING_LENG15                    = "Angstrom"
IDS_DGN_UNIT_STRING_LENG16                    = "chain"
IDS_DGN_UNIT_STRING_LENG17                    = "Ja"
IDS_DGN_UNIT_STRING_LENG18                    = "Ri"
IDS_DGN_UNIT_STRING_LENG19                    = "yard"

IDS_DGN_UNIT_STRING_MASS01                    = "kg"
IDS_DGN_UNIT_STRING_MASS02                    = "g"
IDS_DGN_UNIT_STRING_MASS03                    = "mg"
IDS_DGN_UNIT_STRING_MASS04                    = "water drop"
IDS_DGN_UNIT_STRING_MASS05                    = "lb"
IDS_DGN_UNIT_STRING_MASS06                    = "slug"
IDS_DGN_UNIT_STRING_MASS07                    = "oz"
IDS_DGN_UNIT_STRING_MASS08                    = "t"
IDS_DGN_UNIT_STRING_MASS09                    = "UK t"
IDS_DGN_UNIT_STRING_MASS10                    = "US short t"
IDS_DGN_UNIT_STRING_MASS11                    = "amu"
IDS_DGN_UNIT_STRING_MASS12                    = "k (caret)"
IDS_DGN_UNIT_STRING_MASS13                    = "돈"
IDS_DGN_UNIT_STRING_MASS14                    = "근"
IDS_DGN_UNIT_STRING_MASS15                    = "관"

IDS_DGN_UNIT_STRING_TIME01                    = "sec"
IDS_DGN_UNIT_STRING_TIME02                    = "mili sec"
IDS_DGN_UNIT_STRING_TIME03                    = "micro sec"
IDS_DGN_UNIT_STRING_TIME04                    = "nano sec"
IDS_DGN_UNIT_STRING_TIME05                    = "min"
IDS_DGN_UNIT_STRING_TIME06                    = "hour"
IDS_DGN_UNIT_STRING_TIME07                    = "day"
IDS_DGN_UNIT_STRING_TIME08                    = "week"
IDS_DGN_UNIT_STRING_TIME09                    = "month"
IDS_DGN_UNIT_STRING_TIME10                    = "year"

IDS_DGN_UNIT_STRING_VELO01                    = "km/s"
IDS_DGN_UNIT_STRING_VELO02                    = "m/s"
IDS_DGN_UNIT_STRING_VELO03                    = "cm/s"
IDS_DGN_UNIT_STRING_VELO04                    = "mm/s"
IDS_DGN_UNIT_STRING_VELO05                    = "km/h"
IDS_DGN_UNIT_STRING_VELO06                    = "m/h"
IDS_DGN_UNIT_STRING_VELO07                    = "in/s"
IDS_DGN_UNIT_STRING_VELO08                    = "ft/s"
IDS_DGN_UNIT_STRING_VELO09                    = "yd/s"
IDS_DGN_UNIT_STRING_VELO10                    = "mile/s"
IDS_DGN_UNIT_STRING_VELO11                    = "in/min"
IDS_DGN_UNIT_STRING_VELO12                    = "ft/min"
IDS_DGN_UNIT_STRING_VELO13                    = "yd/min"
IDS_DGN_UNIT_STRING_VELO14                    = "yd/h"
IDS_DGN_UNIT_STRING_VELO15                    = "mile/h"
IDS_DGN_UNIT_STRING_VELO16                    = "knot"
IDS_DGN_UNIT_STRING_VELO17                    = "UK knot"

IDS_DGN_UNIT_STRING_VOLM01                    = "m³"
IDS_DGN_UNIT_STRING_VOLM02                    = "l"
IDS_DGN_UNIT_STRING_VOLM03                    = "cm³ (ml, cc)"
IDS_DGN_UNIT_STRING_VOLM04                    = "mm³"
IDS_DGN_UNIT_STRING_VOLM05                    = "water drop"
IDS_DGN_UNIT_STRING_VOLM06                    = "in³"
IDS_DGN_UNIT_STRING_VOLM07                    = "ft³"
IDS_DGN_UNIT_STRING_VOLM08                    = "yd³"
IDS_DGN_UNIT_STRING_VOLM09                    = "US bushel"
IDS_DGN_UNIT_STRING_VOLM10                    = "US lig pt"
IDS_DGN_UNIT_STRING_VOLM11                    = "US gal"
IDS_DGN_UNIT_STRING_VOLM12                    = "US fl oz"
IDS_DGN_UNIT_STRING_VOLM13                    = "UK bushel"
IDS_DGN_UNIT_STRING_VOLM14                    = "UK pt"
IDS_DGN_UNIT_STRING_VOLM15                    = "UK fl oz"
IDS_DGN_UNIT_STRING_VOLM16                    = "bbl (oil)"
IDS_DGN_UNIT_STRING_VOLM17                    = "quart"

// UNIT CONVERTER (Thermal)
IDS_DGN_UNIT_TYPE_STR_HCAPA                   = "Heat Capacity"
IDS_DGN_UNIT_TYPE_STR_HFLUX                   = "Heat Flux"
IDS_DGN_UNIT_TYPE_STR_HTRAN                   = "Heat Transmit Coefficient"
IDS_DGN_UNIT_TYPE_STR_HRADI                   = "Radiation Constant"
IDS_DGN_UNIT_TYPE_STR_HSPEC                   = "Specific Heat"
IDS_DGN_UNIT_TYPE_STR_HCOND                   = "Thermal Conduct"

IDS_DGN_UNIT_STRING_HCAPA01                   = "J/'C"
IDS_DGN_UNIT_STRING_HCAPA02                   = "kJ/'C"
IDS_DGN_UNIT_STRING_HCAPA03                   = "cal/'C"
IDS_DGN_UNIT_STRING_HCAPA04                   = "kcal/'C"
IDS_DGN_UNIT_STRING_HCAPA05                   = "BTU/'F"

IDS_DGN_UNIT_STRING_HFLUX01                   = "W/m²"
IDS_DGN_UNIT_STRING_HFLUX02                   = "kW/m²"
IDS_DGN_UNIT_STRING_HFLUX03                   = "W/cm²"
IDS_DGN_UNIT_STRING_HFLUX04                   = "kW/cm²"
IDS_DGN_UNIT_STRING_HFLUX05                   = "kcal/m².h"
IDS_DGN_UNIT_STRING_HFLUX06                   = "cal/cm².s"
IDS_DGN_UNIT_STRING_HFLUX07                   = "Btu/in².s"
IDS_DGN_UNIT_STRING_HFLUX08                   = "Btu/ft².s"
IDS_DGN_UNIT_STRING_HFLUX09                   = "Btu/ft².h"

IDS_DGN_UNIT_STRING_HTRAN01                   = "W/m²'C"
IDS_DGN_UNIT_STRING_HTRAN02                   = "kW/m²'C"
IDS_DGN_UNIT_STRING_HTRAN03                   = "W/cm²'C"
IDS_DGN_UNIT_STRING_HTRAN04                   = "kcal/m².h.'C"
IDS_DGN_UNIT_STRING_HTRAN05                   = "cal/cm².s.'C"
IDS_DGN_UNIT_STRING_HTRAN06                   = "Btu/ft².h.'F"

IDS_DGN_UNIT_STRING_HRADI01                   = "W/m².K⁴"
IDS_DGN_UNIT_STRING_HRADI02                   = "kw/m².K⁴"
IDS_DGN_UNIT_STRING_HRADI03                   = "W/cm².K⁴"
IDS_DGN_UNIT_STRING_HRADI04                   = "kcal/m².h.K⁴"
IDS_DGN_UNIT_STRING_HRADI05                   = "cal/cm².s.K⁴"
IDS_DGN_UNIT_STRING_HRADI06                   = "Btu/ft.h.K⁴"

IDS_DGN_UNIT_STRING_HSPEC01                   = "J/kg'C"
IDS_DGN_UNIT_STRING_HSPEC02                   = "kJ/kg'C"
IDS_DGN_UNIT_STRING_HSPEC03                   = "cal/kg'C"
IDS_DGN_UNIT_STRING_HSPEC04                   = "kcal/kg'C"
IDS_DGN_UNIT_STRING_HSPEC05                   = "cal/g'C"
IDS_DGN_UNIT_STRING_HSPEC06                   = "Btu/lb'F"
IDS_DGN_UNIT_STRING_HSPEC07                   = "Wh/kg'C"
IDS_DGN_UNIT_STRING_HSPEC08                   = "kWh/kg'C"

IDS_DGN_UNIT_STRING_HCOND01                   = "W/m'C"
IDS_DGN_UNIT_STRING_HCOND02                   = "kW/m'C"
IDS_DGN_UNIT_STRING_HCOND03                   = "W/cm'C"
IDS_DGN_UNIT_STRING_HCOND04                   = "kW/cm'C"
IDS_DGN_UNIT_STRING_HCOND05                   = "kcal/hm'C"
IDS_DGN_UNIT_STRING_HCOND06                   = "cal/scm'C"
IDS_DGN_UNIT_STRING_HCOND07                   = "Btu/ft².h.'F"
IDS_DGN_UNIT_STRING_HCOND08                   = "Btu/fth'F"
IDS_DGN_UNIT_STRING_HCOND09                   = "Btu/inh'F"

// UNIT CONVERTER (Electric)
IDS_DGN_UNIT_TYPE_STR_CAPAC                   = "Capacitance"
IDS_DGN_UNIT_TYPE_STR_CHARG                   = "Charge"
IDS_DGN_UNIT_TYPE_STR_CURRN                   = "Current"
IDS_DGN_UNIT_TYPE_STR_POTEN                   = "Potential / EMF"
IDS_DGN_UNIT_TYPE_STR_INDUC                   = "Inductance"
IDS_DGN_UNIT_TYPE_STR_FIELD                   = "Magnetic Field"
IDS_DGN_UNIT_TYPE_STR_MFLUX                   = "Magnetic Flux"
IDS_DGN_UNIT_TYPE_STR_RESIS                   = "Resistance"

IDS_DGN_UNIT_STRING_ECAPA01                   = "F (farad)"
IDS_DGN_UNIT_STRING_ECAPA02                   = "micro F"
IDS_DGN_UNIT_STRING_ECAPA03                   = "pF"
IDS_DGN_UNIT_STRING_ECAPA04                   = "stF"
IDS_DGN_UNIT_STRING_ECAPA05                   = "abF"

IDS_DGN_UNIT_STRING_ECHAR01                   = "C (coulomb)"
IDS_DGN_UNIT_STRING_ECHAR02                   = "abC"
IDS_DGN_UNIT_STRING_ECHAR03                   = "stC"
IDS_DGN_UNIT_STRING_ECHAR04                   = "Ah"
IDS_DGN_UNIT_STRING_ECHAR05                   = "Faraday"

IDS_DGN_UNIT_STRING_ECURR01                   = "A"
IDS_DGN_UNIT_STRING_ECURR02                   = "mA"
IDS_DGN_UNIT_STRING_ECURR03                   = "micro A"
IDS_DGN_UNIT_STRING_ECURR04                   = "stA"
IDS_DGN_UNIT_STRING_ECURR05                   = "abA"

IDS_DGN_UNIT_STRING_EPOTE01                   = "V"
IDS_DGN_UNIT_STRING_EPOTE02                   = "abV"
IDS_DGN_UNIT_STRING_EPOTE03                   = "stV"

IDS_DGN_UNIT_STRING_EINDU01                   = "abH"
IDS_DGN_UNIT_STRING_EINDU02                   = "H (henry)"
IDS_DGN_UNIT_STRING_EINDU03                   = "micro H"
IDS_DGN_UNIT_STRING_EINDU04                   = "mH"
IDS_DGN_UNIT_STRING_EINDU05                   = "stH"

IDS_DGN_UNIT_STRING_EFILD01                   = "gauss"
IDS_DGN_UNIT_STRING_EFILD02                   = "T (tesla)"
IDS_DGN_UNIT_STRING_EFILD03                   = "milli gauss"

IDS_DGN_UNIT_STRING_EFLUX01                   = "maxwell"
IDS_DGN_UNIT_STRING_EFLUX02                   = "Wb (weber)"

IDS_DGN_UNIT_STRING_ERESI01                   = "ab Ohm"
IDS_DGN_UNIT_STRING_ERESI02                   = "Ohm"
IDS_DGN_UNIT_STRING_ERESI03                   = "st Ohm"

// UNIT CONVERTER (Miscellaneous)
IDS_DGN_UNIT_TYPE_STR_MISC_VFLOW              = "Volume Flow"
IDS_DGN_UNIT_TYPE_STR_MISC_SVOLM              = "Specific Volume"
IDS_DGN_UNIT_TYPE_STR_MISC_MFLOW              = "Mass Flow"
IDS_DGN_UNIT_TYPE_STR_MISC_INERT              = "Mass Moment of Inertia"
IDS_DGN_UNIT_TYPE_STR_MISC_TEMPE              = "Temperature"

IDS_DGN_UNIT_STRING_MISC_VFLOW01              = "m³/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW02              = "m³/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW03              = "m³/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW04              = "l/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW05              = "l/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW06              = "l/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW07              = "ft³/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW08              = "ft³/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW09              = "ft³/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW10              = "US gal/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW11              = "US gal/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW12              = "US gal/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW13              = "UK gal/s"
IDS_DGN_UNIT_STRING_MISC_VFLOW14              = "UK gal/min"
IDS_DGN_UNIT_STRING_MISC_VFLOW15              = "UK gal/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW16              = "bbl/h"
IDS_DGN_UNIT_STRING_MISC_VFLOW17              = "bbl/day"

IDS_DGN_UNIT_STRING_MISC_SVOLM01              = "m³/kg"
IDS_DGN_UNIT_STRING_MISC_SVOLM02              = "l/kg"
IDS_DGN_UNIT_STRING_MISC_SVOLM03              = "in³/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM04              = "ft³/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM05              = "ft³/slug"
IDS_DGN_UNIT_STRING_MISC_SVOLM06              = "ft³/t"
IDS_DGN_UNIT_STRING_MISC_SVOLM07              = "gal/lb"
IDS_DGN_UNIT_STRING_MISC_SVOLM08              = "UK gal/lb"

IDS_DGN_UNIT_STRING_MISC_MFLOW01              = "kg/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW02              = "kg/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW03              = "kg/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW04              = "g/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW05              = "t/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW06              = "t/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW07              = "t/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW08              = "UK t/h"
IDS_DGN_UNIT_STRING_MISC_MFLOW09              = "lb/s"
IDS_DGN_UNIT_STRING_MISC_MFLOW10              = "lb/min"
IDS_DGN_UNIT_STRING_MISC_MFLOW11              = "lb/h"

IDS_DGN_UNIT_STRING_MISC_INERT01              = "kg-m²"
IDS_DGN_UNIT_STRING_MISC_INERT02              = "kg-cm²"
IDS_DGN_UNIT_STRING_MISC_INERT03              = "g-m²"
IDS_DGN_UNIT_STRING_MISC_INERT04              = "lb-ft²"
IDS_DGN_UNIT_STRING_MISC_INERT05              = "lb-m²"
IDS_DGN_UNIT_STRING_MISC_INERT06              = "oz-m²"

IDS_DGN_UNIT_STRING_MISC_TEMPE01              = "'C"
IDS_DGN_UNIT_STRING_MISC_TEMPE02              = "'F"
IDS_DGN_UNIT_STRING_MISC_TEMPE03              = "K"

// Wind Load Checking ( Simplified Method )
IDS_DGN_WIND_CHCK_OK                          = "OK"
IDS_DGN_WIND_CHCK_NG                          = "NG"
IDS_DGN_WIND_CHCK_SIMP_APP                    = "Simplified Method can be Applied"
IDS_DGN_WIND_CHCK_SIMP_NOT                    = "Simplified Method cannot be Applied"

// Initial Data Setting File Dialog
IDS_DGN_INIT_DATA_FILE_DLG_IMPORT             = "Select File to Import Setting Data."
IDS_DGN_INIT_DATA_FILE_DLG_EXPORT             = "Select File to Export Setting Data."

/////// Quantity Table
IDC_DGN_QUANTITY_AREA_N                       = "Area\n"
IDC_DGN_QUANTITY_BOT_N                        = "Bot.\n"
IDC_DGN_QUANTITY_BOTTOM                       = "Bottom"
IDC_DGN_QUANTITY_BOTTOM_CAP                   = "BOTTOM"
IDC_DGN_QUANTITY_BOTTOM_N                     = "Bottom\n"
IDC_DGN_QUANTITY_BOTTOM_NREBAR                = "Bottom\nRebar"
IDC_DGN_QUANTITY_BOTTOM_NREBAR_N              = "Bottom\nRebar\n"
IDC_DGN_QUANTITY_CENTER                       = "Center"
IDC_DGN_QUANTITY_CONCRETE_N                   = "Concrete\n"
IDC_DGN_QUANTITY_CONCRETE_1_N                 = "Concrete-1\n"
IDC_DGN_QUANTITY_DIR_X                        = "Dir X"
IDC_DGN_QUANTITY_DIR_Y                        = "Dir Y"
IDC_DGN_QUANTITY_DIRECTION_X                  = "Direction X"
IDC_DGN_QUANTITY_DIRECTION_Y                  = "Direction Y"
IDC_DGN_QUANTITY_END_I_CAP                    = "END(I)"
IDC_DGN_QUANTITY_END_J_CAP                    = "END(J)"
IDC_DGN_QUANTITY_END                          = "End."
IDC_DGN_QUANTITY_END_BAR_N                    = "End. Bar\n"
IDC_DGN_QUANTITY_END_N                        = "END\n"
IDC_DGN_QUANTITY_END_NBAR                     = "End\nBar"
IDC_DGN_QUANTITY_END_NBAR_N                   = "End\nBar\n"
IDC_DGN_QUANTITY_EXT_N                        = "Ext.\n"
IDC_DGN_QUANTITY_FOOTING                      = "Footing"
IDC_DGN_QUANTITY_FORM_N                       = "Form\n"
IDC_DGN_QUANTITY_H_BEAM                       = "H-Beam"
IDC_DGN_QUANTITY_HEIGHT                       = "Height"
IDC_DGN_QUANTITY_HOOP                         = "Hoop"
IDC_DGN_QUANTITY_HOOPBAR                      = "HoopBar"
IDC_DGN_QUANTITY_HOR                          = "Hor."
IDC_DGN_QUANTITY_HOR_BAR_N                    = "Hor. Bar\n"
IDC_DGN_QUANTITY_HOR_N                        = "Hor.\n"
IDC_DGN_QUANTITY_INT_N                        = "Int.\n"
IDC_DGN_QUANTITY_LANDING_LEFT_CAP             = "LANDING(LEFT)"
IDC_DGN_QUANTITY_LANDING_RIGHT_CAP            = "LANDING(RIGHT)"
IDC_DGN_QUANTITY_LAYER_1                      = "Layer 1"
IDC_DGN_QUANTITY_LAYER_2                      = "Layer 2"
IDC_DGN_QUANTITY_LAYER_3                      = "Layer 3"
IDC_DGN_QUANTITY_LAYER_4                      = "Layer 4"
IDC_DGN_QUANTITY_LAYER_NO                     = "Layer\nNo."
IDC_DGN_QUANTITY_LEFT                         = "Left"
IDC_DGN_QUANTITY_LX_N                         = "Lx\n"
IDC_DGN_QUANTITY_LY_N                         = "Ly\n"
IDC_DGN_QUANTITY_MAIN                         = "Main"
IDC_DGN_QUANTITY_MAIN_N                       = "Main\n"
IDC_DGN_QUANTITY_MAIN_NBAR                    = "Main\nBar"
IDC_DGN_QUANTITY_MAIN_NBAR_N                  = "Main\nBar\n"
IDC_DGN_QUANTITY_MAINBAR                      = "MainBar"
IDC_DGN_QUANTITY_MAINBAR_N                    = "MainBar\n"
IDC_DGN_QUANTITY_MIDDLE                       = "Middle"
IDC_DGN_QUANTITY_MIDDLE_CAP                   = "MIDDLE"
IDC_DGN_QUANTITY_MIDDLE_N                     = "MIDDLE\n"
IDC_DGN_QUANTITY_NAME                         = "Name"
IDC_DGN_QUANTITY_QUANTITY_PER_COMBINED_WALL   = "Quantity per Combined Wall"
IDC_DGN_QUANTITY_QUANTITY_PER_UNIT_LENGTH     = "Quantity per Unit Length"
IDC_DGN_QUANTITY_REBAR                        = "Rebar"
IDC_DGN_QUANTITY_REBAR1_N                     = "Rebar1\n"
IDC_DGN_QUANTITY_REBAR1_1_N                   = "Rebar1-1\n"
IDC_DGN_QUANTITY_REBAR1_2_N                   = "Rebar1-2\n"
IDC_DGN_QUANTITY_REBAR2_N                     = "Rebar2\n"
IDC_DGN_QUANTITY_REBAR3_N                     = "Rebar3\n"
IDC_DGN_QUANTITY_RIGHT                        = "Right"
IDC_DGN_QUANTITY_SECTION                      = "Section"
IDC_DGN_QUANTITY_SIZE_N                       = "Size\n"
IDC_DGN_QUANTITY_SKIN                         = "Skin"
IDC_DGN_QUANTITY_SKIN_N                       = "Skin\n"
IDC_DGN_QUANTITY_SKIN_NBAR_N                  = "Skin\nBar\n"
IDC_DGN_QUANTITY_STAIR_CAP                    = "STAIR"
IDC_DGN_QUANTITY_STEEL_N                      = "Steel\n"
IDC_DGN_QUANTITY_STIRRUP                      = "Stirrup"
IDC_DGN_QUANTITY_STIRRUP_N                    = "Stirrup\n"
IDC_DGN_QUANTITY_SUB_N                        = "Sub.\n"
IDC_DGN_QUANTITY_SUM_N                        = "Sum\n"
IDC_DGN_QUANTITY_SUM                          = "Sum"
IDC_DGN_QUANTITY_TENSION                      = "Tension"
IDC_DGN_QUANTITY_TENSION_N                    = "Tension\n"
IDC_DGN_QUANTITY_THICK_N                      = "Thick\n"
IDC_DGN_QUANTITY_TOP                          = "Top"
IDC_DGN_QUANTITY_TOP_CAP                      = "TOP"
IDC_DGN_QUANTITY_TOP_N                        = "Top\n"
IDC_DGN_QUANTITY_TOP_NREBAR                   = "Top\nRebar"
IDC_DGN_QUANTITY_TOP_NREBAR_N                 = "Top\nRebar\n"
IDC_DGN_QUANTITY_TOTAL_CAP                    = "TOTAL"
IDC_DGN_QUANTITY_TOTAL_N                      = "Total\n"
IDC_DGN_QUANTITY_UNIT_WALL                    = "Unit Wall"
IDC_DGN_QUANTITY_VER                          = "Ver."
IDC_DGN_QUANTITY_VER_BAR_N                    = "Ver. Bar\n"
IDC_DGN_QUANTITY_VER_N                        = "Ver.\n"
IDC_DGN_QUANTITY_POSI_CANT_L                  = "Cant.L"
IDC_DGN_QUANTITY_POSI_CANT_R                  = "Cant.R"
IDC_DGN_QUANTITY_POSI_COLUMN                  = "Colm%d"
IDC_DGN_QUANTITY_POSI_SPAN                    = "Span%d-%d"

IDS_DGN_IMPORT_FILE_NOT_SELECTED              = "File is not Selected."
IDS_DGN_IMPORT_FILE_NOT_OPEN                  = "File is not Opened."
IDS_DGN_IMPORT_PREF_NOT_SELECTED              = "There is no selected preference to import."
IDS_DGN_IMPORT_PREF_SUCCEED                   = "Preference & Design Option imported successfully."
IDS_DGN_IMPORT_PREF_FAILED                    = "Importing preference & design option is failed."

IDS_DGN_MEMB_NOT_SELECTED                     = "Member is not selected."
IDS_DGN_EDIT_ALL_STORY                        = "All Story is selected.\nDo you want to change all stroy?"

/////// DGN_SELECT_UNIT_GRID
IDS_DGN_NUMB_FORM_UNIT_LENGTH                 = "Length"
IDS_DGN_NUMB_FORM_UNIT_FORCE                  = "Force"
IDS_DGN_NUMB_FORM_UNIT_WEIGHT                 = "Weight"
IDS_DGN_NUMB_FORM_UNIT_AREA 				  = "Area"
IDS_DGN_NUMB_FORM_UNIT_VOLUME 			      = "Volume"
IDS_DGN_NUMB_FORM_UNIT_STIF 				  = "Stiffness"
IDS_DGN_NUMB_FORM_UNIT_MOMENT 			      = "Moment"
IDS_DGN_NUMB_FORM_UNIT_UNIT_MOMENT 		      = "Unit Moment"
IDS_DGN_NUMB_FORM_UNIT_UNIT_FORCE 		      = "Unit Force"
IDS_DGN_NUMB_FORM_UNIT_UNIT_LOAD              = "Unit Load"
IDS_DGN_NUMB_FORM_UNIT_SPRING                 = "Spring"
IDS_DGN_NUMB_FORM_UNIT_STRESS 			      = "Stress"
IDS_DGN_NUMB_FORM_UNIT_PRESSURE 			  = "Pressure"
IDS_DGN_NUMB_FORM_UNIT_ELAST 			      = "Elasticity"
IDS_DGN_NUMB_FORM_UNIT_UNIT_SPRING            = "Unit Spring"
IDS_DGN_NUMB_FORM_UNIT_DENSITY                = "Weight Density"
IDS_DGN_NUMB_FORM_UNIT_MASS_DENSITY           = "Mass Density"
IDS_DGN_NUMB_FORM_UNIT_MEMB_LENGTH            = "Member Length"
IDS_DGN_NUMB_FORM_UNIT_DISTRIBUTED_LOAD       = "Distributed Load"
IDS_DGN_NUMB_FORM_UNIT_CONCENTRATED_LOAD      = "Concentrated Load"
IDS_DGN_NUMB_FORM_UNIT_SOIL_CAPACITY 		  = "Soil Capacity"
IDS_DGN_NUMB_FORM_UNIT_PILE_CAPACITY 		  = "Pile Capacity"
IDS_DGN_NUMB_FORM_UNIT_MEMB_VOLUME 		      = "Member Volume"
IDS_DGN_NUMB_FORM_UNIT_MEMB_AREA 			  = "Member Area"
IDS_DGN_NUMB_FORM_UNIT_MEMB_DENSITY 		  = "Member Density"
IDS_DGN_NUMB_FORM_UNIT_SOIL_STIFFNESS 		  = "Soil Stiffness"

IDS_DGN_MSG_UPDATE_MATL_BY_REBAR_DIA          = "Material by Rebar Diameter option is selected.\nDo you want to update the material data?"
IDS_DGN_RESET_TO_DEFAULT                      = "Do you want to reset data by Default?"